[
    {
        "title":"Buisness Statergy",
        "img":"https://qian-ng.envytheme.com/assets/img/services/services1.jpg",
        "discription":"DCI Consulting, a human resources risk management consultancy, has completed the acquisition of Glenn Barlett Consulting Services, a boutique firm specializing in affirmative action compliance.Founded in 1991 and based in Englishtown, NJ, Glenn Barlett focuses on preparing affirmative action plans (AAPs) for public and private sector employers across industries. The firm also develops and presents affirmative action and equal employment opportunity training, analyzes personnel data to identify potential employment discrimination, and supplies demographic data needed for affirmative action and diversity programs.Glenn Barlett’s team includes managing partner Vicky Ungvary and partners Sorng Yiv and Vath Yiv.DCI’s acquisition of Glenn Barlett will strengthen the firm’s service offerings for federal contractors, including Office of Federal Contract Compliance Programs (OFCCP) compliance and HR analytics. Glenn Barlett staff and clients will transition to the DCI brand.This acquisition will help us grow as a firm while continuing to offer the highest level of service, said David Cohenpresident of DCI Consulting. Glenn Barlett Consulting brings decades of experience in OFCCP compliance. We are excited to welcome them to our team and look forward to providing their clients with additional resources and top-tier service."
    },
    {
        "title":"Revenue Growth",
        "img":"https://qian-ng.envytheme.com/assets/img/services/services3.jpg",
        "discription":"NIIT, an India-based talent development and managed training services firm, has acquired St. Charles Consulting Group, a St. Charles, IL-based talent development consultancy.Founded in 2002 by former partners of Arthur Andersen’s internal training unit, St. Charles provides consulting, design, implementation, and managed services for strategic learning programs to professional services firms and Fortune 500s. The firm’s solutions portfolio helps address areas including strategic transformation, financial impact, future workforce, risk mitigation, and learner empowerment.St. Charles has a network of more than 500 consultants, with 126 employees listed on LinkedIn.NIIT’s acquisition of St. Charles will grow its learning consulting practice and expand its presence in the professional services sector. The deal is part of the Gurgaon-headquartered company’s stated goal of accelerating growth through investments that add new capabilities.St. Charles will join the wholly owned subsidiary NIIT (USA) Inc."
    },
    {
        "title":"Buisness Planing",
        "img":"https://qian-ng.envytheme.com/assets/img/services/services5.jpg",
        "discription":"EY yesterday announced a global alliance with Shopify, the Ottawa-headquartered e-commerce platform company.The alliance combines Shopify’s user-friendly and rapidly deployable platform with EY’s integration capabilities across front-end customer experience and back-end systems including ERP, CRM, inventory management, and financial reporting.The EY-Shopify alliance – which was founded in Canada – will have a two-pronged focus: the first area is EY e-commerce system integration for large companies, while the second focus area is helping clients sell regulated products such as pharmaceuticals and alcoholic beverages. The latter will leverage EY’s global capabilities in compliance, tax, trade, and managed services“The alliance with Shopify will provide a broad range of transformational services that help merchants comply with the complex regulatory landscape and build new operating models that deliver seamless, sustainable customer experiences. I am excited to see this partnership unlock opportunities for clients that allow them to grow at scale while creating long-term value for all stakeholders,"
    },
    {
        "title":"operating model design",
        "img":"https://qian-ng.envytheme.com/assets/img/services/services4.jpg",
        "discription":"INDEVCO ConsultancyMore news on Risk & ComplianceWith the risk landscape evolving fast for businesses, gaining the right insights to remain in control of the situation is essential. INDEVCO Consultancy is a consulting firm looking to do exactly that – we spoke with Wael Daher on how the firm helps its clients navigate the risk landscapeWael Daher has been with the Lebanon-based consultancy since 2004 – rising to a senior director position and leader of the company’s Risk Assessment & Internal Audit Advisory service, which serves clients across various sectors.Our service helps companies improve performance and secure value generation by mitigating risks, meeting high internal standards, and complying with international regulations. I believe that risk assessment and internal audit advisory are essential to securing business continuity through ethical and world-class business practices"
    },
    {
        "title":"Sales And Marketing",
        "img":"https://qian-ng.envytheme.com/assets/img/services/services6.jpg",
        "discription":"DThe UK’s mortgage lending is forecast to slow dramatically in 2023 – something which is already seeing a rapid decline in house prices. According to a new report from EY, as much as 10% of value could be lost.As the worsening economic environment continues to have a significant impact on households and businesses, interest rates have been hiked. According to the Bank of England, the move is intended to slow the rate of inflation in the UK, which is still hovering around 10%.In practice, however, inflation remains high, while the increase in interest has served to make borrowing harder. In a market where wages have stagnated for over a decade, this is presenting a huge challenge to those who would otherwise be looking to get on the housing ladder – especially as rates are the highest they’ve been in a decade and are set to rise further.."
    },
    {
        "title":"Drive Revenue Growth",
        "img":"https://qian-ng.envytheme.com/assets/img/services/services7.jpg",
        "discription":"Rio Tinto has kicked-off plans to build an own in-house software development team, as the multinational aims to downsize its reliance on external technology consulting firms such as Accenture, Capgemini and CGI.The mining giant has for years relied on a group of external consultancies for its software development activities. But with software emerging at the forefront of the company’s innovation and improvement agenda, Rio Tinto’s chief information officer Dan Evans said the time was right to bring these activities in-house.The chief information officer added that the change in strategy would also position Rio Tinto as a more attractive employer for IT talent. The company’s Information System and Technology division currently has around 1,000 staff, and over the next five years, the miner will seek to hire up to 600 software developers.Starting from scratch, the ASX-listed company has to date hired 20 people in Brisbane, and signed a deal with global software engineering firm Endava, which has provided 50 developers to help establish the practice. Endava will initially serve as a provider of talent, and over time extract itself from the organisation as the in-house team shapes up. During the process, Endava’s experts will guide the setup and growth of the in-house team, and provide training and coaching of Rio Tinto’s technologists in software design, modern agile delivery and customer-centric product design."
    }
]